# <center> Client Data Analysis with Pandas 


<img src="https://img.freepik.com/premium-vector/illustration-customer-data-user-data-customer-analytic-user-personal-data-customer-statistic_258153-187.jpg">

#### Reading in Data

1. Read in the comma-separated file "client_list.csv". Assign as variable `df1`.
2. Read in the delimted file "client_list.table". Assign as variable as `df2`.
3. Read in the fixed-width file "client_list.txt". Assign as variable `df3`
4. Read in the comma-separated file "client_list.csv", skip the first 3 rows, and ignore the header. Do not assign to variable (just return a view).
5. Read in the comma-separated file "client_list.csv". Set the column headers in all caps. Assign as variable `df`.
6. Read in the comma-separated file "client_list_practice.csv" and only extract the columns ["FIRST_NAME","AGE","EYE_COLOR"]. Do not assign to a variable.

## <font color=purple> READING IN DATA

In [147]:
import pandas as pd

In [148]:
# TASK 1

df1 = pd.read_csv("client_list.csv")
df1.head()

  first_name LAST_NAME gender  Age Hair_COLOR eye_Color
0   Jennifer     Jones      F   27      black     brown
1      Jaime   Roberts      M   32      brown     hazel
2    Michael   Johnson      M   55        red     green
3       Mary     Adams      F   42     blonde      blue
4     Robert  Phillips      M   37     blonde     brown

In [149]:
# TASK 2

df2 = pd.read_table("client_list.table", sep=";")
df2.head()

  first_name LAST_NAME gender  Age Hair_COLOR eye_Color
0   Jennifer     Jones      F   27      black     brown
1      Jaime   Roberts      M   32      brown     hazel
2    Michael   Johnson      M   55        red     green
3       Mary     Adams      F   42     blonde      blue
4     Robert  Phillips      M   37     blonde     brown

In [150]:
# TASK 3 

df3 = pd.read_fwf("client_list.txt")
df3.head()

  first_name LAST_NAME gender  Age Hair_COLOR eye_Color
0   Jennifer     Jones      F   27      black     brown
1      Jaime   Roberts      M   32      brown     hazel
2    Michael   Johnson      M   55        red     green
3       Mary     Adams      F   42     blonde      blue
4     Robert  Phillips      M   37     blonde     brown

In [151]:
# TASK 4

df4 = pd.read_csv("client_list.csv",skiprows=4, header=None) # type skiprows=4 to skip the first 3 rows
df4.head()

         0         1  2   3       4      5
0     Mary     Adams  F  42  blonde   blue
1   Robert  Phillips  M  37  blonde  brown
2   Thomas     Moore  M  60   brown   blue
3  Natalie    Potter  F  21   brown  green
4   Brenda     Jones  F  18  blonde  brown

In [152]:
# TASK 5

df = pd.read_csv("client_list.csv")
df.columns = df.columns.str.upper()
df.head()

  FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
0   Jennifer     Jones      F   27      black     brown
1      Jaime   Roberts      M   32      brown     hazel
2    Michael   Johnson      M   55        red     green
3       Mary     Adams      F   42     blonde      blue
4     Robert  Phillips      M   37     blonde     brown

In [153]:
# TASK 6

pd.read_csv("client_list_practice.csv")[["FIRST_NAME", "AGE", "EYE_COLOR"]].head()

  FIRST_NAME   AGE EYE_COLOR
0   Jennifer  27.0     brown
1      Jaime  32.0     hazel
2    Michael  55.0     green
3       Mary  42.0       NaN
4        NaN  37.0     brown

#### Slicing a Data Set

7. Slice rows 5 through 11 of `df`. Can you provide two ways of doing this?
8. Return only the columns ['LAST_NAME','AGE','HAIR_COLOR'] for `df`. Can you provide two ways of doing this?
9. Combine problems 1 and 2: return rows 5 though 11 and columns  ['LAST_NAME','AGE','HAIR_COLOR'] for `df`. Can you provide two ways of doing this?

##  <font color=purple> SLICING DATA

In [154]:
# TASK 7

df[4:11] # first way

   FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
4      Robert  Phillips      M   37     blonde     brown
5      Thomas     Moore      M   60      brown      blue
6     Natalie    Potter      F   21      brown     green
7      Brenda     Jones      F   18     blonde     brown
8     Michael     Smith      M   58      brown     brown
9    Jennifer     Smith      F   36      black     brown
10    Michael     Smith      M   37      black     hazel

In [155]:
#second way

df.loc[4:10] # loc takes the last limit into account
# and we can do slicing depending on the labels
# on the other words, If index's names are string we can do slicing with loc by specifying them with quotation mark

   FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
4      Robert  Phillips      M   37     blonde     brown
5      Thomas     Moore      M   60      brown      blue
6     Natalie    Potter      F   21      brown     green
7      Brenda     Jones      F   18     blonde     brown
8     Michael     Smith      M   58      brown     brown
9    Jennifer     Smith      F   36      black     brown
10    Michael     Smith      M   37      black     hazel

In [156]:
#third way

df.iloc[4:11] # iloc does slicing depending on numerical indexes
# and doesn't take the last limit into account

   FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
4      Robert  Phillips      M   37     blonde     brown
5      Thomas     Moore      M   60      brown      blue
6     Natalie    Potter      F   21      brown     green
7      Brenda     Jones      F   18     blonde     brown
8     Michael     Smith      M   58      brown     brown
9    Jennifer     Smith      F   36      black     brown
10    Michael     Smith      M   37      black     hazel

In [157]:
# TASK 8

#first way

df[["LAST_NAME", "AGE", "HAIR_COLOR"]].head() 
# If you select columns more than one, you should double square brackets --> [[]]

  LAST_NAME  AGE HAIR_COLOR
0     Jones   27      black
1   Roberts   32      brown
2   Johnson   55        red
3     Adams   42     blonde
4  Phillips   37     blonde

In [158]:
# second way

df.loc[:,["LAST_NAME", "AGE", "HAIR_COLOR"]].head()

  LAST_NAME  AGE HAIR_COLOR
0     Jones   27      black
1   Roberts   32      brown
2   Johnson   55        red
3     Adams   42     blonde
4  Phillips   37     blonde

In [159]:
# TASK 9

#first way

df[4:11][["LAST_NAME", "AGE", "HAIR_COLOR"]]

   LAST_NAME  AGE HAIR_COLOR
4   Phillips   37     blonde
5      Moore   60      brown
6     Potter   21      brown
7      Jones   18     blonde
8      Smith   58      brown
9      Smith   36      black
10     Smith   37      black

In [160]:
df.loc[4:10, ["LAST_NAME", "AGE", "HAIR_COLOR"]]

   LAST_NAME  AGE HAIR_COLOR
4   Phillips   37     blonde
5      Moore   60      brown
6     Potter   21      brown
7      Jones   18     blonde
8      Smith   58      brown
9      Smith   36      black
10     Smith   37      black

In [53]:
df.iloc[4:11, ["LAST_NAME", "AGE", "HAIR_COLOR"]] 
# received error message because iloc works with only numerical indexes or numerical names

IndexError: .iloc requires numeric indexers, got ['LAST_NAME' 'AGE' 'HAIR_COLOR']

#### Simple Queries

10. Find the subset of `df` where the client's last name is "Smith".
11. Find the subset of `df` where the client's hair color is not black.
12. Find the subset of `df` where the client's hair color is red and reset the values to "ginger".

In [164]:
# TASK 10
df[df["LAST_NAME"]== "Smith"]

   FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
8     Michael     Smith      M   58      brown     brown
9    Jennifer     Smith      F   36      black     brown
10    Michael     Smith      M   37      black     hazel

In [165]:
# TASK 11

df[df["HAIR_COLOR"] != "black"].head()

  FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
1      Jaime   Roberts      M   32      brown     hazel
2    Michael   Johnson      M   55     ginger     green
3       Mary     Adams      F   42     blonde      blue
4     Robert  Phillips      M   37     blonde     brown
5     Thomas     Moore      M   60      brown      blue

In [166]:
# TASK 12

df["HAIR_COLOR"] = df["HAIR_COLOR"].replace("red", "ginger")

df.head()

  FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
0   Jennifer     Jones      F   27      black     brown
1      Jaime   Roberts      M   32      brown     hazel
2    Michael   Johnson      M   55     ginger     green
3       Mary     Adams      F   42     blonde      blue
4     Robert  Phillips      M   37     blonde     brown

#### Complex Queries

13. Find the subset of `df` where the clients are females older than 30 years.
14. Repeat problem 1, but return only the hair color and eye color.
15. Find the unique combination of hair and eye color for women older than 25 years.

In [167]:
# TASK 13

df[(df["GENDER"] == "F") & (df["AGE"]>30)]

   FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
3        Mary     Adams      F   42     blonde      blue
9    Jennifer     Smith      F   36      black     brown
13      Jaime  Anderson      F   46      brown     green

In [168]:
# TASK 14

df[(df["GENDER"] == "F") & (df["AGE"]>30)][["HAIR_COLOR", "EYE_COLOR"]]

   HAIR_COLOR EYE_COLOR
3      blonde      blue
9       black     brown
13      brown     green

In [169]:
# TASK 15

df[(df["GENDER"] == "F") & (df["AGE"]>25)][["HAIR_COLOR", "EYE_COLOR"]].drop_duplicates()

# unique() brings unique values of a variable/column.
# drop_duplicates() brings unique values of variables/columns more than one.

   HAIR_COLOR EYE_COLOR
0       black     brown
3      blonde      blue
13      brown     green


#### Additional Dataframe Operations

16. Perform a `merge` using "client_list.csv" and "customer_id_list.csv". Assign the resulting dataframe as `clients`.
17. Perform a `merge` using `clients` and "purchase_log.csv" and limit the subset to only clients who made purchases. Assign the resulting dataframe as `detailed_sales`.
18. Use `groupby` to find the client who spent the most money on purchases. Determine how much he/she spent. HINT: save the intermediate dataframe from using `groupby` as `spenders` before applying slicing to determine the client who spent the most money on purchases.
19. (BONUS) Modify the answer to problem 3 slightly to determine exactly what items where purchased by the top spending client.

In [170]:
client_list =pd.read_csv("client_list.csv")
client_id = pd.read_csv("customer_id_list.csv")

In [171]:
pd.merge(client_id, client_list).head()

,CUSTOMER_ID,FIRST_NAME,LAST_NAME,GENDER,AGE,first_name,gender,Age,Hair_COLOR,eye_Color
0,1,Jennifer,Jones,F,27,Jennifer,F,27,black,brown
1,1,Jennifer,Jones,F,27,Brenda,F,18,blonde,brown
2,2,Jaime,Roberts,M,32,Jaime,M,32,brown,hazel
3,3,Michael,Johnson,M,55,Michael,M,55,red,green
4,4,Mary,Adams,F,42,Mary,F,42,blonde,blue

In [172]:
client_id.head()

   CUSTOMER_ID FIRST_NAME LAST_NAME GENDER  AGE
0            1   Jennifer     Jones      F   27
1            2      Jaime   Roberts      M   32
2            3    Michael   Johnson      M   55
3            4       Mary     Adams      F   42
4            5     Robert  Phillips      M   37

In [173]:
client_list.head()

  first_name LAST_NAME gender  Age Hair_COLOR eye_Color
0   Jennifer     Jones      F   27      black     brown
1      Jaime   Roberts      M   32      brown     hazel
2    Michael   Johnson      M   55        red     green
3       Mary     Adams      F   42     blonde      blue
4     Robert  Phillips      M   37     blonde     brown

**<font color=blue> The merge operation in pandas is case-sensitive. If two columns contain the same data but their column names are not identical (even due to capitalization differences), pandas treats them as separate columns. As a result, the merged DataFrame may include duplicate columns that represent the same information.**

In [174]:
client_list.columns = client_list.columns.str.upper()
print(client_list.columns)

Index(['FIRST_NAME', 'LAST_NAME', 'GENDER', 'AGE', 'HAIR_COLOR', 'EYE_COLOR'], dtype='object')

**<font color=blue> Let's do the process again:**

In [175]:
clients = pd.merge(client_id, client_list)

In [176]:
clients.head()

   CUSTOMER_ID FIRST_NAME LAST_NAME GENDER  AGE HAIR_COLOR EYE_COLOR
0            1   Jennifer     Jones      F   27      black     brown
1            2      Jaime   Roberts      M   32      brown     hazel
2            3    Michael   Johnson      M   55        red     green
3            4       Mary     Adams      F   42     blonde      blue
4            5     Robert  Phillips      M   37     blonde     brown

In [177]:
purchase = pd.read_csv("purchase_log.csv")
purchase.head()

   CUSTOMER_ID        DATE    SKU           ITEM_DESCRIPTION   PRICE
0           14  03/17/2014   3844                  green tie   14.99
1            9  02/14/2015  23493          box of chocolates   29.99
2           11  03/01/2015  60385  Nike Lunarglide 6-size8.5  109.99
3            1  01/01/2015  39490                    aspirin   12.99
4            4  10/31/2014  94586           Superman costume   39.99

In [178]:
detailed_sales=pd.merge(clients, purchase, on= "CUSTOMER_ID", how="inner")

detailed_sales.head()

,CUSTOMER_ID,FIRST_NAME,LAST_NAME,GENDER,AGE,HAIR_COLOR,EYE_COLOR,DATE,SKU,ITEM_DESCRIPTION,PRICE
0,1,Jennifer,Jones,F,27,black,brown,01/01/2015,39490,aspirin,12.99
1,2,Jaime,Roberts,M,32,brown,hazel,12/24/2014,39933,gift card,50.00
2,4,Mary,Adams,F,42,blonde,blue,10/31/2014,94586,Superman costume,39.99
3,6,Thomas,Moore,M,60,brown,blue,09/13/2014,22495,birthday card,3.99
4,9,Michael,Smith,M,58,brown,brown,02/14/2015,23493,box of chocolates,29.99

In [179]:
spenders = detailed_sales.groupby("CUSTOMER_ID")["PRICE"].sum()
print(spenders)

CUSTOMER_ID
1      12.99
2      50.00
4      39.99
6       3.99
9     229.98
11    109.99
14     14.99
Name: PRICE, dtype: float64

In [180]:
spenders.max() # max spend

229.98000000000002

In [181]:
spenders.idxmax() # max spending customer id

9

In [182]:
detailed_sales[detailed_sales["CUSTOMER_ID"] == spenders.idxmax()]
# Other information about the relevant customer in the detailed_sales table

,CUSTOMER_ID,FIRST_NAME,LAST_NAME,GENDER,AGE,HAIR_COLOR,EYE_COLOR,DATE,SKU,ITEM_DESCRIPTION,PRICE
4,9,Michael,Smith,M,58,brown,brown,02/14/2015,23493,box of chocolates,29.99
5,9,Michael,Smith,M,58,brown,brown,02/14/2015,38349,bottle of champagne,199.99

In [183]:
detailed_sales[detailed_sales["CUSTOMER_ID"] == spenders.idxmax()][["CUSTOMER_ID", "ITEM_DESCRIPTION"]] 
# The customer who spent the most purchased the following items: box of chocolates and bottle of champagne

   CUSTOMER_ID     ITEM_DESCRIPTION
4            9    box of chocolates
5            9  bottle of champagne

#### Writing Files

20. Save `detailed_sales` as a csv file named "df_out.csv" with no indices.
21. Save `detailed_sales` to a pickle file named "df_out.p"

In [144]:
detailed_sales.to_csv("df_out.csv", index=False)

In [145]:
detailed_sales.to_pickle("df_out.p")